"""

武装飞船


下面来开发一个名为《外星人入侵》的游戏吧！为此将使用 Pygame，这是一组功能强大而有趣的模块，可用
于管理图形、动画乃至声音，让你能够更轻松地开发复杂的游戏。通过使用 Pygame 来处理在屏幕上绘制图
像等任务，可将重点放在程序的高级逻辑上。

在这里，你将安装 Pygame，再创建一艘能够根据用户输入左右移动和射击的飞船。后续你将创建一群作为射
杀目标的外星人，并改进该游戏：限制可供玩家使用的飞船数，并且添加记分牌。

在开发这款游戏的过程中，你还将学习如何管理包含多个文件的项目。你将重构很多代码并管理文件的内容，
以确保项目组织有序以及提高效率。

开发游戏是趣学语言的理想方式。看别人玩你编写的游戏能获得满足感，而编写简单的游戏有助于你明白专业
级游戏是怎么编写出来的。在这个的过程中，请动手输入并运行代码，以明白各个代码块对整个游戏所做的贡
献，并且尝试不同的值和设置，以对如何改进游戏的交互性有更深入的认识。

注意：游戏《外星人入侵》将包含很多不同的文件，因此请在系统中新建一个名为 alien_invasion 的文
件夹，并将该项目的所有文件都存储到该文件夹中，这样相关的 import 语句才能正确工作。

"""