"""

注释


在大多数编程语言中，注释是一项很有用的功能。随着程序越来越大、越来越复杂，就应在其中添加说明，对你解决问题
的方法进行大致的阐述。注释 让你能够使用自然语言在程序中添加说明。



1、如何编写注释

在 Python 中，注释用井号（#）标识。井号后面的内容都会被 Python 解释器忽略，如下所示：

# 向大家问好。
print("Hello Python people!")

Python解释器将忽略第一行，只执行第二行。



2、该编写什么样的注释

编写注释的主要目的是阐述代码要做什么，以及是如何做的。在开发项目期间，你对各个部分如何协同工作了如指掌，但
过段时间后，有些细节你可能不记得了。当然，你总是可以通过研究代码来确定各个部分的工作原理，但通过编写注释以
清晰的自然语言对解决方案进行概述，可节省很多时间。

要成为专业程序员或与其他程序员合作，就必须编写有意义的注释。当前，大多数软件是合作编写的，编写者可能是同一
家公司的多名员工，也可能是众多致力于同一个开源项目的人员。训练有素的程序员都希望代码中包含注释，因此你最好
从现在开始就在程序中添加描述性注释。

作为新手，最值得养成的习惯之一就是在代码中编写清晰、简洁的注释。

如果不确定是否要编写注释，就问问自己：在找到合理的解决方案之前，考虑了多个解决方案吗？如果答案是肯定的，就
编写注释对你的解决方案进行说明吧。相比回过头去再添加注释，删除多余的注释要容易得多。从现在开始，这里的示例
都将使用注释来阐述代码的工作原理。

"""